example-app/app/Http/Controllers/GradeController.php

select * from `grades` limit 10 offset 0
select count(*) as aggregate from `grades`
---
    public function index()
    {
        $grades = Grade::paginate(10);

select * from `grades` where `grades`.`id` = '19' limit 1
---
    public function show(string $id)
    {
        $grade = Grade::find($id);

select * from `grades` where `grades`.`id` = '1' limit 1
---
    public function edit(string $id)
    {
        $grade = Grade::find($id);