example-app/app/Http/Controllers/StudentController.php

    public function index()
    {
        $student_count = Student::all () ->count();
        $grade_count = Grade::all () ->count();
        $subject_count = Subject::all () ->count();

        $students=Student::paginate(10);
---
select * from `students` limit 10 offset 0
select count(*) as aggregate from `students`

    public function create()
    {
        $grades=Grade::pluck("grade_name","id");
---
select `grade_name`, `id` from `grades`

    public function show(string $id)
    {
        $student=Student::find($id);
---
select * from `students` where `students`.`id` = '1' limit 1

    public function edit(string $id)
    {
        $student=Student::find($id);
        $grades=Grade::pluck('grade_name','id');
---
select * from `students` where `students`.`id` = '1' limit 1
select `grade_name`, `id` from `grades`

    public function update(Request $request, string $id)
    {
        $student= Student::find($id);
---
select * from `students` where `students`.`id` = '1' limit 1