example-app/app/Http/Controllers/SubjectController.php

select * from `subjects` limit 10 offset 0
select count(*) as aggregate from `subjects`
---
    public function index()
    {
        $student_count = Student::all () ->count();
        $grade_count = Grade::all () ->count();
        $subject_count = Subject::all () ->count();

        $subjects=Subject::paginate(10);

select `id`, `subject_name` from `subjects`
---
    public function create()
    {
        $subjects=Subject::pluck("id","subject_name");

select * from `subjects` where `subjects`.`id` = '61' limit 1
---
    public function show(string $id)
    {
        $subject = Subject::find($id);

select * from `subjects` where `subjects`.`id` = '1' limit 1
---
    public function edit(string $id)
    {
        $subject=Subject::find($id);