example-app/app/Http/Controllers/SubjectController.php

select `students`.*, `student_subject`.`subject_id` as `pivot_subject_id`, `student_subject`.`student_id` as `pivot_student_id` from `students` inner join `student_subject` on `students`.`id` = `student_subject`.`student_id` where `student_subject`.`subject_id` = 61
---
    public function show(string $id)
    {
        $subject = Subject::find($id);
         $students =Subject::find($id)->students;