example-app/routes/web.php

  return view('grades.index', compact('grades'));
});

Route::get('/grade/{id}', function ($id) {
  $grades=Grade::find($id);
  $students=Grade::find($id)->students;
  return view('grades.show',compact('grades','students',));
});
---
select * from `grades`

  return view ('subject.index', compact('subjects'));
});

Route::get('/subject/{id}', function ($id) {
  $subject = Subject::find($id);
  $students =Subject::find($id)->students;
  return view('subject.show', compact('subject', 'students'));
});
---
select * from `students`
select * from `subjects`